erp3l/src/Catalogs/СП_Кластеры/СП_Кластеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СП_Кластеры</name>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемаДляСхем</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧерезRestAPI</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Брокеры</name>
    <attributes>
      <name>Сервер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порт</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>7</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыКонфигурации</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.СП_ПараметрыКонфигурации</types>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.СП_ПараметрыКонфигурации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>EnumRef.СП_каф_ТипыПараметров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/СП_Кластеры/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Параметры конфигурации в примитивном виде на основе данных таблицы значений
// "ПараметрыКонфигурации".
// 
// Параметры:
//  ВходящиеПараметрыКонфигурации - Входящие параметры конфигурации
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Параметры конфигурации в примитивном виде:
// 		* Ключ - Строка, ПланВидовХарактеристикСсылка.СП_ПараметрыКонфигурации
// 		* Значение - Строка, СправочникСсылка.СП_ЗначенияПараметровКонфигурации
//
Функция ПараметрыКонфигурацииВПримитивномВиде(ВходящиеПараметрыКонфигурации) Экспорт
	
	Таблица = НоваяТаблицаПараметровКонфигурации();
		
	Для Каждого Строка Из ВходящиеПараметрыКонфигурации Цикл
		СтрокаТаблицы = Таблица.Добавить();	
		СтрокаТаблицы.Ключ = КлючПараметраКонфигурации(Строка.Ключ);
		СтрокаТаблицы.Значение = ЗначениеПараметраКонфигурации(Строка.Значение);
		СтрокаТаблицы.ТипПараметра = Строка.ТипПараметра;
	КонецЦикла;
	
	Возврат Таблица;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НоваяТаблицаПараметровКонфигурации()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Ключ");
	Таблица.Колонки.Добавить("Значение");
	Таблица.Колонки.Добавить("ТипПараметра");
	
	Возврат Таблица;
		
КонецФункции

Функция КлючПараметраКонфигурации(Значение)
	
	Если ТипЗнч(Значение) = Тип("ПланВидовХарактеристикСсылка.СП_ПараметрыКонфигурации") Тогда
		Возврат Значение.Наименование;
			
	Иначе
		Возврат Значение;
				
	КонецЕсли;
	
КонецФункции

Функция ЗначениеПараметраКонфигурации(Значение)
	
	ТипЗначенияПараметра = ТипЗнч(Значение); 
	Если ТипЗначенияПараметра = Тип("СправочникСсылка.СП_ЗначенияПараметровКонфигурации") Тогда
		Возврат Значение.Наименование;
			
	ИначеЕсли ТипЗначенияПараметра = Тип("Число") Тогда
		Возврат XMLСтрока(Значение);
		
	Иначе
		Возврат Значение;
				
	КонецЕсли;
	
КонецФункции

#КонецОбласти
